In [40]:
import datetime

# Get the current date and time
current_time = datetime.datetime.now()

# Print the current date and time
print("Timestamp:", current_time)

Timestamp: 2024-04-05 09:22:52.007173

In [41]:
# pip install ipykernal
# pip install pandas
# pip install numpy
#pip install matplotlib  
#pip install seaborn
#pip install statsmodels
# pip install scikit-learn
# pip install openpyxl

## Lab session 1
Use dataset of penguins to find the correlation between the columns and to draw the regression plot for each variable as well as heatmap and pairplot

## Lab session 2
To perform exploratory data analysis using data of penguins to find different trends and patterns in the data

## Lab session 3
To perform the EDA on --------------- to find the different patterns and trends in the given dataset

## Lab Session 4
Write compete detail of left join, right join, inner and outer join. Develop two dataframes of 15 rows with columns as
data1= id, Name, nationality,age\
data2= id, Marks in math, marks in science, marks in english, marks in history
and merge these dataframes using all types of joins.

## Lab session 5

Using the dataset of titanic, check the normal distribution of all numeric columns and use power transformation and quantile transformation methods (Whichever approperiate) to convert these columns as parametric distribited columns

## Lab session 6
Use the one hot encoding, ordinal encoding and label encoding to convert the categorical columns into encoded data using the data of tips

## Lab session 7
1. Apply simple linear regression model using the data of "IRIS". Take sepal_width as attribute and sepal_length as target variable. Split the data into training and testing and find the accuracy of the model
2. Apply multiple linear regression model using the data of "IRIS". Take sepal_width, petal_length, petal_width as attribute and sepal_length as target variable. Split the data into training and testing and find the accuracy of the model

## Lab session 8

By using logistic regression and using the data of penguins, predict the species of penguins based on the columns culmen_length_mm, culmen_depth_mm, flipper_length_mm, body_mass_g. Split the data into training and testing and find the accuracy of the model. Evaluate the model using confusion matrix

## Lab session 9

By using SVC and using the data of penguins, predict the species of penguins based on the columns culmen_length_mm, culmen_depth_mm, flipper_length_mm, body_mass_g. Split the data into training and testing and find the accuracy of the model. Evaluate the model using confusion matrix

In [95]:
penguin=sns.load_dataset('penguins')
penguin.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [29]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [30]:
df=sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True